# macOS Developer Environment Brewfile

# Taps
#tap "homebrew/cask-fonts"

# CLI Tools
brew "git"
brew "tig"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "wget"
brew "tmux"
brew "openssl@3"
brew "gnupg"
brew "fish"
brew "vim"
brew "node"
brew "python@3.13"
brew "pnpm"
brew "direnv"
brew "gum"
brew "heroku"
brew "pipx"
brew "tree"
brew "uv"

# Development Tools
brew "mas"

# Fonts
#cask "font-jetbrains-mono"

# GUI Applications
cask "iterm2"
cask "visual-studio-code"
cask "cursor"
cask "raycast"
cask "voiceink"
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "discord"
cask "obsidian"
cask "aldente"
cask "nordvpn"
cask "docker"
cask "docker-compose"
cask "unnaturalscrollwheels"
cask "chatgpt"
cask "claude"
cask "lmstudio"
cask "adguard"
cask "appcleaner"

# Media Tools (uncomment as needed)
#brew "yt-dlp"               # YouTube downloader
#brew "yle-dl"               # YLE (Finnish Broadcasting) downloader

# Optional/Specialized Tools (uncomment as needed)
#cask "android-platform-tools"
#cask "bluesnooze"
#cask "bruno"
#cask "dbeaver-community"
#cask "ollama"
#cask "openscad"
